male_00_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 0, # '어린이', 만 6~11세 의미
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.010, # 수술 여부
                  'survey_alcohol_code' : 0.000, # 음주 여부
                  'survey_smoking_code' : 0.000, # 흡연 여부
                  
                  'HF01' : 0.000, # 간
                  'HF02' : 0.000, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.100, # 치아/구강
                  'HF05' : 0.000, # 면역
                  'HF06' : 0.000, # 노화/항산화
                  'HF07' : 0.200, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.000, # 위/소화
                  'HF10' : 0.500, # 장건강
                  'HF11' : 0.000, # 비뇨
                  'HF12' : 0.000, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.000, # 운동
                  'HF18' : 0.000, # 체지방
                  'HF19' : 0.000, # 스트레스/수면
                  'HF20' : 0.500, # 두뇌
                  'HF21' : 0.800, # 어린이 성장
                  'HF22' : 0.000, # 혈당
                  'HF23' : 0.000, # 혈압
                  'HF24' : 0.000, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.005, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.013, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.010, # 위장관
                  'DI02' : 0.010, # 간
                  'DI03' : 0.010, # 심혈관계
                  'DI04' : 0.010, # 신장
                  'DI05' : 0.005, # 당뇨
                  'DI06' : 0.010, # 고혈압
                  'DI07' : 0.010, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.010, # 갑상선
                  'DI10' : 0.010, # 천식
                  'DI11' : 0.005, # 담낭
                  'DI12' : 0.010, # 자가면역
                  'DI13' : 0.010, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

male_10_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 10, # '청소년', 만 12~18세 의미
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.010, # 수술 여부
                  'survey_alcohol_code' : 0.000, # 음주 여부
                  'survey_smoking_code' : 0.000, # 흡연 여부
                  
                  'HF01' : 0.000, # 간
                  'HF02' : 0.000, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.050, # 치아/구강
                  'HF05' : 0.000, # 면역
                  'HF06' : 0.000, # 노화/항산화
                  'HF07' : 0.200, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.000, # 위/소화
                  'HF10' : 0.500, # 장건강
                  'HF11' : 0.000, # 비뇨
                  'HF12' : 0.000, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.100, # 운동
                  'HF18' : 0.100, # 체지방
                  'HF19' : 0.100, # 스트레스/수면
                  'HF20' : 0.700, # 두뇌
                  'HF21' : 0.100, # 어린이 성장
                  'HF22' : 0.000, # 혈당
                  'HF23' : 0.000, # 혈압
                  'HF24' : 0.000, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.005, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.013, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.010, # 위장관
                  'DI02' : 0.010, # 간
                  'DI03' : 0.010, # 심혈관계
                  'DI04' : 0.010, # 신장
                  'DI05' : 0.005, # 당뇨
                  'DI06' : 0.010, # 고혈압
                  'DI07' : 0.010, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.010, # 갑상선
                  'DI10' : 0.010, # 천식
                  'DI11' : 0.005, # 담낭
                  'DI12' : 0.010, # 자가면역
                  'DI13' : 0.010, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }


male_20_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 20, # 20대 만 19세 이상 의미
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.009, # 수술 여부
                  'survey_alcohol_code' : 0.631, # 음주 여부
                  'survey_smoking_code' : 0.376, # 흡연 여부
                  
                  'HF01' : 0.198, # 간
                  'HF02' : 0.420, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.098, # 치아/구강
                  'HF05' : 0.132, # 면역
                  'HF06' : 0.082, # 노화/항산화
                  'HF07' : 0.360, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.084, # 위/소화
                  'HF10' : 0.265, # 장건강
                  'HF11' : 0.074, # 비뇨
                  'HF12' : 0.016, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.406, # 운동
                  'HF18' : 0.400, # 체지방
                  'HF19' : 0.341, # 스트레스/수면
                  'HF20' : 0.006, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.004, # 혈당
                  'HF23' : 0.039, # 혈압
                  'HF24' : 0.034, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.265, # 위장관
                  'DI02' : 0.198, # 간
                  'DI03' : 0.039, # 심혈관계
                  'DI04' : 0.010, # 신장
                  'DI05' : 0.004, # 당뇨
                  'DI06' : 0.039, # 고혈압
                  'DI07' : 0.034, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.022, # 갑상선
                  'DI10' : 0.023, # 천식
                  'DI11' : 0.004, # 담낭
                  'DI12' : 0.009, # 자가면역
                  'DI13' : 0.109, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

male_30_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 30, # 30대 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.016, # 수술 여부
                  'survey_alcohol_code' : 0.748, # 음주 여부
                  'survey_smoking_code' : 0.427, # 흡연 여부
                  
                  'HF01' : 0.251, # 간
                  'HF02' : 0.463, # 피로
                  'HF03' : 0.045, # 뼈/관절
                  'HF04' : 0.071, # 치아/구강
                  'HF05' : 0.238, # 면역
                  'HF06' : 0.097, # 노화/항산화
                  'HF07' : 0.187, # 피부
                  'HF08' : 0.155, # 눈
                  'HF09' : 0.182, # 위/소화
                  'HF10' : 0.227, # 장건강
                  'HF11' : 0.104, # 비뇨
                  'HF12' : 0.026, # 요로
                  'HF13' : 0.212, # 전립선
                  'HF14' : 0.024, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.284, # 운동
                  'HF18' : 0.445, # 체지방
                  'HF19' : 0.382, # 스트레스/수면
                  'HF20' : 0.160, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.143, # 혈당
                  'HF23' : 0.257, # 혈압
                  'HF24' : 0.269, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.260, # 위장관
                  'DI02' : 0.238, # 간
                  'DI03' : 0.173, # 심혈관계
                  'DI04' : 0.044, # 신장
                  'DI05' : 0.050, # 당뇨
                  'DI06' : 0.173, # 고혈압
                  'DI07' : 0.186, # 고지혈증
                  'DI08' : 0.003, # 혈액응고장애
                  'DI09' : 0.017, # 갑상선
                  'DI10' : 0.050, # 천식
                  'DI11' : 0.010, # 담낭
                  'DI12' : 0.009, # 자가면역
                  'DI13' : 0.097, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

male_40_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 40, # 40대 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.016, # 수술 여부
                  'survey_alcohol_code' : 0.748, # 음주 여부
                  'survey_smoking_code' : 0.427, # 흡연 여부
                  
                  'HF01' : 0.251, # 간
                  'HF02' : 0.463, # 피로
                  'HF03' : 0.045, # 뼈/관절
                  'HF04' : 0.071, # 치아/구강
                  'HF05' : 0.238, # 면역
                  'HF06' : 0.097, # 노화/항산화
                  'HF07' : 0.187, # 피부
                  'HF08' : 0.155, # 눈
                  'HF09' : 0.182, # 위/소화
                  'HF10' : 0.227, # 장건강
                  'HF11' : 0.104, # 비뇨
                  'HF12' : 0.026, # 요로
                  'HF13' : 0.212, # 전립선
                  'HF14' : 0.024, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.284, # 운동
                  'HF18' : 0.445, # 체지방
                  'HF19' : 0.382, # 스트레스/수면
                  'HF20' : 0.160, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.143, # 혈당
                  'HF23' : 0.257, # 혈압
                  'HF24' : 0.269, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.260, # 위장관
                  'DI02' : 0.238, # 간
                  'DI03' : 0.173, # 심혈관계
                  'DI04' : 0.044, # 신장
                  'DI05' : 0.050, # 당뇨
                  'DI06' : 0.173, # 고혈압
                  'DI07' : 0.186, # 고지혈증
                  'DI08' : 0.011, # 혈액응고장애
                  'DI09' : 0.021, # 갑상선
                  'DI10' : 0.023, # 천식
                  'DI11' : 0.014, # 담낭
                  'DI12' : 0.009, # 자가면역
                  'DI13' : 0.104, # 신경/정신계
                  'DI14' : 0.005, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

male_50_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 50, # 50대 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.028, # 수술 여부
                  'survey_alcohol_code' : 0.713, # 음주 여부
                  'survey_smoking_code' : 0.369, # 흡연 여부
                  
                  'HF01' : 0.245, # 간
                  'HF02' : 0.362, # 피로
                  'HF03' : 0.055, # 뼈/관절
                  'HF04' : 0.063, # 치아/구강
                  'HF05' : 0.300, # 면역
                  'HF06' : 0.136, # 노화/항산화
                  'HF07' : 0.204, # 피부
                  'HF08' : 0.190, # 눈
                  'HF09' : 0.203, # 위/소화
                  'HF10' : 0.304, # 장건강
                  'HF11' : 0.135, # 비뇨
                  'HF12' : 0.031, # 요로
                  'HF13' : 0.375, # 전립선
                  'HF14' : 0.044, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.313, # 운동
                  'HF18' : 0.372, # 체지방
                  'HF19' : 0.350, # 스트레스/수면
                  'HF20' : 0.406, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.217, # 혈당
                  'HF23' : 0.358, # 혈압
                  'HF24' : 0.342, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황

                  'DI01' : 0.304, # 위장관
                  'DI02' : 0.245, # 간
                  'DI03' : 0.358, # 심혈관계
                  'DI04' : 0.097, # 신장
                  'DI05' : 0.217, # 당뇨
                  'DI06' : 0.358, # 고혈압
                  'DI07' : 0.342, # 고지혈증
                  'DI08' : 0.026, # 혈액응고장애
                  'DI09' : 0.030, # 갑상선
                  'DI10' : 0.017, # 천식
                  'DI11' : 0.025, # 담낭
                  'DI12' : 0.016, # 자가면역
                  'DI13' : 0.099, # 신경/정신계
                  'DI14' : 0.005, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

male_60_rating = {'survey_sex' : 'm', 
                  'survey_age_group' : 60, # 60세 이상 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.075, # 수술 여부
                  'survey_alcohol_code' : 0.667, # 음주 여부
                  'survey_smoking_code' : 0.286, # 흡연 여부
                  
                  'HF01' : 0.237, # 간
                  'HF02' : 0.223, # 피로
                  'HF03' : 0.200, # 뼈/관절
                  'HF04' : 0.053, # 치아/구강
                  'HF05' : 0.348, # 면역
                  'HF06' : 0.117, # 노화/항산화
                  'HF07' : 0.099, # 피부
                  'HF08' : 0.270, # 눈
                  'HF09' : 0.211, # 위/소화
                  'HF10' : 0.279, # 장건강
                  'HF11' : 0.217, # 비뇨
                  'HF12' : 0.052, # 요로
                  'HF13' : 0.538, # 전립선
                  'HF14' : 0.213, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.303, # 운동
                  'HF18' : 0.364, # 체지방
                  'HF19' : 0.339, # 스트레스/수면
                  'HF20' : 0.636, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.288, # 혈당
                  'HF23' : 0.506, # 혈압
                  'HF24' : 0.332, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황

                  'DI01' : 0.279, # 위장관
                  'DI02' : 0.237, # 간
                  'DI03' : 0.506, # 심혈관계
                  'DI04' : 0.255, # 신장
                  'DI05' : 0.288, # 당뇨
                  'DI06' : 0.506, # 고혈압
                  'DI07' : 0.332, # 고지혈증
                  'DI08' : 0.109, # 혈액응고장애
                  'DI09' : 0.022, # 갑상선
                  'DI10' : 0.029, # 천식
                  'DI11' : 0.037, # 담낭
                  'DI12' : 0.016, # 자가면역
                  'DI13' : 0.074, # 신경/정신계
                  'DI14' : 0.022, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }


# 남성 + 어린이와 동일
female_00_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 0, # '어린이', 만 6~11세 의미
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.010, # 수술 여부
                  'survey_alcohol_code' : 0.000, # 음주 여부
                  'survey_smoking_code' : 0.000, # 흡연 여부
                  
                  'HF01' : 0.000, # 간
                  'HF02' : 0.000, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.100, # 치아/구강
                  'HF05' : 0.000, # 면역
                  'HF06' : 0.000, # 노화/항산화
                  'HF07' : 0.200, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.000, # 위/소화
                  'HF10' : 0.500, # 장건강
                  'HF11' : 0.000, # 비뇨
                  'HF12' : 0.000, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.000, # 운동
                  'HF18' : 0.000, # 체지방
                  'HF19' : 0.000, # 스트레스/수면
                  'HF20' : 0.500, # 두뇌
                  'HF21' : 0.800, # 어린이 성장
                  'HF22' : 0.000, # 혈당
                  'HF23' : 0.000, # 혈압
                  'HF24' : 0.000, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.005, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.013, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.010, # 위장관
                  'DI02' : 0.010, # 간
                  'DI03' : 0.010, # 심혈관계
                  'DI04' : 0.010, # 신장
                  'DI05' : 0.005, # 당뇨
                  'DI06' : 0.010, # 고혈압
                  'DI07' : 0.010, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.010, # 갑상선
                  'DI10' : 0.010, # 천식
                  'DI11' : 0.005, # 담낭
                  'DI12' : 0.010, # 자가면역
                  'DI13' : 0.010, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

female_10_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 10, # '청소년', 만 12~18세 의미
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.010, # 수술 여부
                  'survey_alcohol_code' : 0.000, # 음주 여부
                  'survey_smoking_code' : 0.000, # 흡연 여부
                  
                  'HF01' : 0.000, # 간
                  'HF02' : 0.000, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.050, # 치아/구강
                  'HF05' : 0.000, # 면역
                  'HF06' : 0.000, # 노화/항산화
                  'HF07' : 0.400, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.000, # 위/소화
                  'HF10' : 0.500, # 장건강
                  'HF11' : 0.000, # 비뇨
                  'HF12' : 0.000, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.000, # 여성
                  'HF17' : 0.300, # 운동
                  'HF18' : 0.300, # 체지방
                  'HF19' : 0.100, # 스트레스/수면
                  'HF20' : 0.700, # 두뇌
                  'HF21' : 0.300, # 어린이 성장
                  'HF22' : 0.000, # 혈당
                  'HF23' : 0.000, # 혈압
                  'HF24' : 0.000, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.005, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.013, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.010, # 위장관
                  'DI02' : 0.010, # 간
                  'DI03' : 0.010, # 심혈관계
                  'DI04' : 0.010, # 신장
                  'DI05' : 0.005, # 당뇨
                  'DI06' : 0.010, # 고혈압
                  'DI07' : 0.010, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.010, # 갑상선
                  'DI10' : 0.010, # 천식
                  'DI11' : 0.005, # 담낭
                  'DI12' : 0.010, # 자가면역
                  'DI13' : 0.010, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.000 # 호르몬제
                  }

female_20_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 20, # 20대 만 19세 이상 의미
                  'survey_pregnancy_code' : 0.014, # 임신 여부
                  'survey_operation_code' : 0.015, # 수술 여부
                  'survey_alcohol_code' : 0.612, # 음주 여부
                  'survey_smoking_code' : 0.094, # 흡연 여부
                  
                  'HF01' : 0.162, # 간
                  'HF02' : 0.434, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.054, # 치아/구강
                  'HF05' : 0.188, # 면역
                  'HF06' : 0.115, # 노화/항산화
                  'HF07' : 0.608, # 피부
                  'HF08' : 0.000, # 눈
                  'HF09' : 0.098, # 위/소화
                  'HF10' : 0.341, # 장건강
                  'HF11' : 0.074, # 비뇨
                  'HF12' : 0.086, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.516, # 여성
                  'HF17' : 0.318, # 운동
                  'HF18' : 0.381, # 체지방
                  'HF19' : 0.376, # 스트레스/수면
                  'HF20' : 0.006, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.006, # 혈당
                  'HF23' : 0.016, # 혈압
                  'HF24' : 0.048, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.341, # 위장관
                  'DI02' : 0.162, # 간
                  'DI03' : 0.016, # 심혈관계
                  'DI04' : 0.017, # 신장
                  'DI05' : 0.006, # 당뇨
                  'DI06' : 0.016, # 고혈압
                  'DI07' : 0.048, # 고지혈증
                  'DI08' : 0.000, # 혈액응고장애
                  'DI09' : 0.025, # 갑상선
                  'DI10' : 0.030, # 천식
                  'DI11' : 0.004, # 담낭
                  'DI12' : 0.012, # 자가면역
                  'DI13' : 0.111, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.050 # 호르몬제
                  }

female_30_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 30, # 30대 
                  'survey_pregnancy_code' : 0.059, # 임신 여부
                  'survey_operation_code' : 0.048, # 수술 여부
                  'survey_alcohol_code' : 0.532, # 음주 여부
                  'survey_smoking_code' : 0.097, # 흡연 여부
                  
                  'HF01' : 0.194, # 간
                  'HF02' : 0.507, # 피로
                  'HF03' : 0.000, # 뼈/관절
                  'HF04' : 0.060, # 치아/구강
                  'HF05' : 0.345, # 면역
                  'HF06' : 0.208, # 노화/항산화
                  'HF07' : 0.567, # 피부
                  'HF08' : 0.031, # 눈
                  'HF09' : 0.110, # 위/소화
                  'HF10' : 0.334, # 장건강
                  'HF11' : 0.048, # 비뇨
                  'HF12' : 0.086, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.000, # 여성 갱년기
                  'HF16' : 0.522, # 여성
                  'HF17' : 0.276, # 운동
                  'HF18' : 0.393, # 체지방
                  'HF19' : 0.382, # 스트레스/수면
                  'HF20' : 0.029, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.020, # 혈당
                  'HF23' : 0.020, # 혈압
                  'HF24' : 0.095, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.334, # 위장관
                  'DI02' : 0.194, # 간
                  'DI03' : 0.020, # 심혈관계
                  'DI04' : 0.036, # 신장
                  'DI05' : 0.020, # 당뇨
                  'DI06' : 0.020, # 고혈압
                  'DI07' : 0.095, # 고지혈증
                  'DI08' : 0.005, # 혈액응고장애
                  'DI09' : 0.027, # 갑상선
                  'DI10' : 0.033, # 천식
                  'DI11' : 0.010, # 담낭
                  'DI12' : 0.012, # 자가면역
                  'DI13' : 0.095, # 신경/정신계
                  'DI14' : 0.001, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.050 # 호르몬제
                  }

female_40_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 40, # 40대 
                  'survey_pregnancy_code' : 0.004, # 임신 여부
                  'survey_operation_code' : 0.026, # 수술 여부
                  'survey_alcohol_code' : 0.521, # 음주 여부
                  'survey_smoking_code' : 0.067, # 흡연 여부
                  
                  'HF01' : 0.205, # 간
                  'HF02' : 0.477, # 피로
                  'HF03' : 0.154, # 뼈/관절
                  'HF04' : 0.049, # 치아/구강
                  'HF05' : 0.338, # 면역
                  'HF06' : 0.137, # 노화/항산화
                  'HF07' : 0.316, # 피부
                  'HF08' : 0.130, # 눈
                  'HF09' : 0.161, # 위/소화
                  'HF10' : 0.291, # 장건강
                  'HF11' : 0.093, # 비뇨
                  'HF12' : 0.086, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.080, # 여성 갱년기
                  'HF16' : 0.384, # 여성
                  'HF17' : 0.222, # 운동
                  'HF18' : 0.424, # 체지방
                  'HF19' : 0.423, # 스트레스/수면
                  'HF20' : 0.160, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.068, # 혈당
                  'HF23' : 0.134, # 혈압
                  'HF24' : 0.150, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.291, # 위장관
                  'DI02' : 0.205, # 간
                  'DI03' : 0.134, # 심혈관계
                  'DI04' : 0.065, # 신장
                  'DI05' : 0.068, # 당뇨
                  'DI06' : 0.134, # 고혈압
                  'DI07' : 0.150, # 고지혈증
                  'DI08' : 0.011, # 혈액응고장애
                  'DI09' : 0.038, # 갑상선
                  'DI10' : 0.016, # 천식
                  'DI11' : 0.014, # 담낭
                  'DI12' : 0.044, # 자가면역
                  'DI13' : 0.067, # 신경/정신계
                  'DI14' : 0.006, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.050 # 호르몬제
                  }

female_50_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 50, # 50대 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.031, # 수술 여부
                  'survey_alcohol_code' : 0.407, # 음주 여부
                  'survey_smoking_code' : 0.063, # 흡연 여부
                  
                  'HF01' : 0.199, # 간
                  'HF02' : 0.374, # 피로
                  'HF03' : 0.328, # 뼈/관절
                  'HF04' : 0.055, # 치아/구강
                  'HF05' : 0.424, # 면역
                  'HF06' : 0.192, # 노화/항산화
                  'HF07' : 0.344, # 피부
                  'HF08' : 0.160, # 눈
                  'HF09' : 0.210, # 위/소화
                  'HF10' : 0.390, # 장건강
                  'HF11' : 0.158, # 비뇨
                  'HF12' : 0.087, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.580, # 여성 갱년기
                  'HF16' : 0.229, # 여성
                  'HF17' : 0.245, # 운동
                  'HF18' : 0.355, # 체지방
                  'HF19' : 0.387, # 스트레스/수면
                  'HF20' : 0.406, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.101, # 혈당
                  'HF23' : 0.265, # 혈압
                  'HF24' : 0.383, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.210, # 위장관
                  'DI02' : 0.199, # 간
                  'DI03' : 0.265, # 심혈관계
                  'DI04' : 0.097, # 신장
                  'DI05' : 0.101, # 당뇨
                  'DI06' : 0.265, # 고혈압
                  'DI07' : 0.383, # 고지혈증
                  'DI08' : 0.031, # 혈액응고장애
                  'DI09' : 0.073, # 갑상선
                  'DI10' : 0.027, # 천식
                  'DI11' : 0.025, # 담낭
                  'DI12' : 0.044, # 자가면역
                  'DI13' : 0.083, # 신경/정신계
                  'DI14' : 0.006, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.050 # 호르몬제
                  }

female_60_rating = {'survey_sex' : 'f', 
                  'survey_age_group' : 60, # 60세 이상 
                  'survey_pregnancy_code' : 0.000, # 임신 여부
                  'survey_operation_code' : 0.073, # 수술 여부
                  'survey_alcohol_code' : 0.283, # 음주 여부
                  'survey_smoking_code' : 0.036, # 흡연 여부
                  
                  'HF01' : 0.193, # 간
                  'HF02' : 0.229, # 피로
                  'HF03' : 0.652, # 뼈/관절
                  'HF04' : 0.046, # 치아/구강
                  'HF05' : 0.492, # 면역
                  'HF06' : 0.165, # 노화/항산화
                  'HF07' : 0.167, # 피부
                  'HF08' : 0.228, # 눈
                  'HF09' : 0.213, # 위/소화
                  'HF10' : 0.359, # 장건강
                  'HF11' : 0.232, # 비뇨
                  'HF12' : 0.132, # 요로
                  'HF13' : 0.000, # 전립선
                  'HF14' : 0.000, # 남성
                  'HF15' : 0.335, # 여성 갱년기
                  'HF16' : 0.000, # 여성 
                  'HF17' : 0.237, # 운동
                  'HF18' : 0.347, # 체지방
                  'HF19' : 0.374, # 스트레스/수면
                  'HF20' : 0.636, # 두뇌
                  'HF21' : 0.000, # 어린이 성장
                  'HF22' : 0.209, # 혈당
                  'HF23' : 0.455, # 혈압
                  'HF24' : 0.502, # 혈관/혈액순환
                  
                  'AL01' : 0.002, # 갑각류
                  'AL02' : 0.001, # 옻
                  'AL03' : 0.001, # 땅콩
                  'AL04' : 0.001, # 프로폴리스
                  'AL05' : 0.001, # 대두/대두단백
                  'AL06' : 0.001, # 에스트로겐/이소플라본
                  'AL07' : 0.001, # 우유/유제품
                  'AL08' : 0.001, # 소맥
                  'AL09' : 0.001, # 호프
                  'AL10' : 0.001, # 호박씨
                  'AL11' : 0.001, # 홍삼
                  'AL12' : 0.001, # 사상자
                  'AL13' : 0.001, # 산수유
                  'AL14' : 0.001, # 무화과
                  'AL15' : 0.001, # 사과
                  'AL16' : 0.001, # 국화과
                  'AL17' : 0.001, # 난황
                  'AL18' : 0.001, # 달맞이꽃종자유
                  'AL19' : 0.001, # 석류
                  'AL20' : 0.001, # 강황
                  
                  'DI01' : 0.359, # 위장관
                  'DI02' : 0.193, # 간
                  'DI03' : 0.455, # 심혈관계
                  'DI04' : 0.189, # 신장
                  'DI05' : 0.209, # 당뇨
                  'DI06' : 0.455, # 고혈압
                  'DI07' : 0.502, # 고지혈증
                  'DI08' : 0.050, # 혈액응고장애
                  'DI09' : 0.029, # 갑상선
                  'DI10' : 0.037, # 천식
                  'DI11' : 0.037, # 담낭
                  'DI12' : 0.076, # 자가면역
                  'DI13' : 0.078, # 신경/정신계
                  'DI14' : 0.011, # 암
                  'DI15' : 0.001, # 단장증후군/유당불내증
                  'DI16' : 0.001, # 피부 광과민성
                  'DI17' : 0.050 # 호르몬제
                  }

adult_function_weight = {'HF01' : 0.150, # 간
                         'HF02' : 0.698, # 피로
                         'HF03' : 0.501, # 뼈/관절
                         'HF04' : 0.023, # 치아/구강
                         'HF05' : 1.000, # 면역
                         'HF06' : 0.881, # 노화/항산화
                         'HF07' : 0.268, # 피부
                         'HF08' : 0.265, # 눈
                         'HF09' : 0.008, # 위/소화
                         'HF10' : 0.322, # 장건강
                         'HF11' : 0.005, # 비뇨
                         'HF12' : 0.005, # 요로
                         'HF13' : 0.031, # 전립선
                         'HF14' : 0.005, # 남성
                         'HF15' : 0.049, # 여성 갱년기
                         'HF16' : 0.407, # 여성
                         'HF17' : 0.465, # 운동
                         'HF18' : 0.188, # 체지방
                         'HF19' : 0.046, # 스트레스/수면
                         'HF20' : 0.294, # 두뇌
                         'HF21' : 0.000, # 어린이 성장
                         'HF22' : 0.058, # 혈당
                         'HF23' : 0.037, # 혈압
                         'HF24' : 0.770, # 혈관/혈액순환
                         }

# survey_operation은 제왕절개를 계획하는 사람도 있을 수 있으므로 기존 값 유지
pregnancy_ratings = {'HF25': 0.900, 
                    'survey_alcohol_code' : 0.014, 
                    'survey_smoking_code' : 0.011
                    }

sex_age_group_ratings = [male_00_rating, male_10_rating, male_20_rating, male_30_rating, male_40_rating, male_50_rating, male_60_rating,
                    female_00_rating, female_10_rating, female_20_rating, female_30_rating, female_40_rating, female_50_rating, female_60_rating]

function_rankings = ['1st', '2nd', '3rd', '4th', '5th']